import { HomeIcon } from '@/components/icons/forPopMenu/HomeIcon';
import Link from 'next/link';
import Image from 'next/image';
import profilePic from '../../public/bg-hero.webp';

const Oferta = () => {
  return (
    <main>
      <section className="relative bg-hero-bg">
        <div className="div-container py-[20px] md:py-[44px] mx-auto text-center flex flex-col gap-5 z-10 relative">
          <h3 className="text-left text-mainTitleBlack flex gap-2">
            <Link href="/" className="flex gap-2 items-center">
              <HomeIcon />
              <span className="sr-only md:not-sr-only">Adrenalin_gym</span>
            </Link>
            <span className="font-semibold"> &gt; Договір оферти</span>
          </h3>
          <h1 className="title mb-14 text-mainTitleBlack">Договір оферти</h1>
        </div>
        <Image
          alt="Adrenalin gym foto"
          src={profilePic}
          placeholder="blur"
          fill
          priority
          sizes="100vw"
          style={{
            objectFit: 'cover',
          }}
        />
      </section>
      <section className="py-[40px] md:py-[44px] lg:py-[88px] bg-white dark:bg-darkBody">
        <div
          className="div-container flex flex-col 
         justify-center gap-4"
        >
          <h2 className="text-center text-xl font-semibold text-mainTitle dark:text-mainTitleBlack">
            ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ
          </h2>
          <p className="text-mainText dark:text-mainTextBlack">
            на надання послуг фітнес-клубу «Adrenalin»
          </p>
          <p className="text-mainText dark:text-mainTextBlack">м.Тернопіль</p>
          <p className="text-mainText dark:text-mainTextBlack indent-5">
            Наведена нижче інформація є офіційною пропозицією (публічною
            офертою) ФОП Теслюк Юрія Леонідовича (надалі — «Виконавець»)
            будь-якій фізичній або юридичній особі (надалі — «Замовник») укласти
            договір на спортивно – оздоровчі послуги (далі за текстом «Послуги»)
            на території фітнес клубу «Adrenalin» (далі за текстом – Клуб), який
            знаходиться за адресою: м. Тернопіль, вул. Академіка Сахарова 10, а
            «Замовник» зобов’язується сплатити ці Послуги та дотримуватися усіх
            умов цього договору.
            <br /> Ця оферта — публічний договір приєднання та відповідно до
            чинного законодавства України має належну юридичну силу. Умови
            оферти однакові для всіх споживачів і не можуть бути змінені другою
            стороною договору.
            <br /> Відповідно до ст. 633 Цивільного кодексу України, ця
            пропозиція є публічною офертою, повним і беззастережним прийняттям
            (акцептом) якої вважається купівля послуг на веб-сервері Виконавця
            (gym-adrenalin.com.ua).
          </p>
          <ol className="text-mainTitle dark:text-mainTitleBlack text-center list-decimal list-inside">
            <li className="">
              Предмет договору
              <ol
                className="text-mainText dark:text-mainTextBlack text-left indent-5 list-decimal 
                        list-inside"
              >
                <li>
                  Предметом цього договору-оферти є надання Замовнику спортивно-
                  оздоровчих послуг у фітнес клубі «Adrenalin» відповідно до
                  обраної послуги (тренування, тренування з тренером, програма
                  тренувань/харчування).
                </li>
                <li>
                  Договір-оферта і Додатки до нього є офіційними документами і
                  публікуються на сайті Виконавця, а так само в
                  загальнодоступному місці на території фітнес клубу «Adrenalin»
                </li>
                <li>
                  Замовник, вибравши послугу через сайт Виконавця, робить заявку
                  на її придбання. Після підготовки документів, Виконавець
                  запрошує Замовника в клуб для видачі клубної картки.
                </li>
                <li>
                  Замовник оплачує спортивно-оздоровчі послуги в фітнес клубі
                  «Adrenalin» на умовах цього договору. Оплачуючи послуги
                  Замовник тим самим підтверджує свою згоду з положеннями цього
                  договору.
                </li>
                <li>
                  Перелік послуг, які входять до вартості Угоди: користування
                  роздягальнями, душовими кабінами, користування персональними
                  шафами в роздягальнях для зберігання речей під час тренування,
                  відвідування тренажерної зали, відвідування групових занять
                  згідно розкладу затвердженого Клубом, (за виключенням
                  персонального заняття або оренди залу). Інші (додаткові)
                  послуги є платними.
                </li>
                <li>
                  Після оплати послуг згідно умов Договору, на період надання
                  Послуг Замовнику видається іменна клубна карта (надалі Клубна
                  Карта), яка є підставою для отримання Послуг.
                </li>
                <li>
                  Строк дії Клубної картки при умові виконання Замовником
                  зобов’язань по оплаті Послуг дорівнює строку який передбачений
                  і відповідає типу Клубної Картки обраної Замовником, та
                  відраховується з моменту початку використання Замовником
                  Послуг, які надає Виконавець, або на 31 день з дня оплати
                  послуги, автоматично.
                </li>
              </ol>
            </li>
            <li>
              Права та обов’язки Сторін
              <ol
                className="text-mainText dark:text-mainTextBlack text-left indent-5 list-decimal 
                        list-inside"
              >
                <p>Виконавець зобов’язується:</p>
                <li>
                  Надавати Замовникові сплачені ним Послуги у відповідності до
                  категорії та типу Клубної картки останнього.
                </li>
                <li>
                  Підтримувати функціонування спортивного обладнання та
                  інвентарю, а також допоміжних побутових приміщень, призначених
                  для користування Замовником.
                </li>
                <p>Виконавець має право:</p>
                <li>
                  Без згоди другої Сторони встановлювати перелік і вартість
                  послуг, а також послуг, які не входять до Клубної Картки,
                  (надалі “Додаткові послуги”)
                </li>
                <li>
                  Залучати інших осіб для надання Послуг/Додаткових послуг.
                </li>
                <li>
                  У випадку аварійних ситуацій, виникнувших не з вини Клуба
                  та/або обставин непереборної сили, в односторонньому порядку
                  обмежувати обсяг і порядок надання Послуг/Додаткових послуг
                  Замовнику.
                </li>
                <li>
                  Вимагати від Замовника відшкодування за нанесені ним
                  матеріальні збитки та завдану моральну шкоду на користь Клубу
                  або на користь співробітників Клубу (в залежності від
                  випадку), окрім третіх осіб, якщо не доведено, що шкода
                  завдана не з вини Замовника.
                </li>

                <p>Замовник зобов’язується:</p>
                <li>
                  Завчасно та у повному обсязі сплачуати вартість Послуг то
                  Додаткових послуг за цим договором, які передбаченні і
                  відповідають типу Клубної картки обраної Замовником;
                </li>
                <li>Не передавати Клубну картку іншим особам.</li>
                <li>
                  Відвідувати Клуб в межах його робочого часу згідно з графіком,
                  зазначеному у Правилах та у відповідності до типу Клубної
                  картки, що належить Замовникові.
                </li>
                <p>Замовник має право:</p>
                <li>
                  Користуватися Послугами Клубy, брати участь у заходах, які
                  проводитимуться в Клубі.
                </li>
                <li>
                  При виникненні обставин, тимчасово перешкоджаючих отриманню
                  Послуг, використати додаткову функцію призупинення дії клубної
                  карти (надалі за текстом “Заморозка”) Призупинення дії клубної
                  карти оформлюється на підставі усної або письмовоїї заяви
                  Замовника. Мінімальний термін Заморозки становить 2 дні,
                  загальний термін заморозки визначається видом клубної карти і
                  періодом її дії. Сумарний строк Заморозки на протязі дії
                  клубної карти не може перевищувати 15 днів, і не може бути
                  продовжений за будь-яких обставин, в тому числі хвороба,
                  службове відрядження.
                </li>
                <li>
                  Єдиним виключенням, згідно якого Замовнику надається право
                  збільшення строку Заморозки, є вагітність. У разі настання
                  вагітності під час дії Договору. Надання додаткової заморозки
                  по вагітності надається при наявності довідки від лікаря (про
                  вагітність з передбачуваним строком пологів) та письмової
                  заяви від Члена клубу на ім’я директора Клубу, та виключно на
                  розсуд Клубу і є доповненням до діючої Угоди.
                </li>
                <li>
                  Строк дії Заморозки починається від дня звернення Замовника.
                  Заморозку неможливо оформити минулою датою.
                </li>
                <li>
                  За порушення замовником/клієнтом встановлених правил клубу –
                  адміністрація «Adrenalin», залишає за собою право закрити
                  клубну картку замовника/клієнта та відмовити у наданні будь –
                  яких послуг без повернення відповідно сплачених коштів за неї.
                </li>
                <li>
                  Батьки дитини (або інші офіційні представники дитини), які
                  дали згоду на тренування їхньої дитини в фітнес-клубі
                  «Adrenalin», беруть на себе повну правову, моральну, та
                  фінансову відповідальність. А також підтверджують, що їх
                  дитина не має медичних протипоказань до інтенсивних фізичних
                  навантажень, а саме: вірусних захворювань, небезпечних
                  інфекцій, що передаються повітряно-крапельним і контактним
                  шляхом (через дотики, спортінвентар, екіпірування), а також
                  захворювань опорно-рухового апарату (міжхребцевих гриж,
                  переломів хребта, сколіозу, коксартрозу, артрозу іншої
                  равматизації суглобів та хребта), дихальної системи та
                  серцево-судинної системи та інших захворювань, що можуть
                  перешкоджати дитині відвідувати тренування.
                </li>
                <li>
                  Також, батьки (або інші офіційні представники дитини)
                  добровільно беруть на себе відповідальність за можливі травми,
                  чи інші ушкодження здоров’ю їх дитини, отримані в наслідок
                  використання спортивного обладнання та\або під час здійснення
                  будь-яких фізичних вправ (навантажень), та підтверджують
                  відсутність протипоказань до тренуваннь.
                </li>
              </ol>
            </li>
            <li>
              Відповідальність сторін і вирішення спорів
              <ol
                className="text-mainText dark:text-mainTextBlack text-left indent-5 list-decimal 
                        list-inside"
              >
                <li>
                  За порушення цього Договору Сторони несуть відповідальність
                  встановленим цим договором та чинним законодавством України.
                </li>
                <li>
                  Сторони не несуть відповідальності за порушення своїх
                  зобов’язань за цим Договором, якщо воно сталося не з їх вини.
                  Сторона вважається невинною, якщо вона доведе, що вжила всіх
                  залежних від неї заходів для належного виконання свого
                  зобов’язання.
                </li>
                <li>
                  Замовник (клієнт) несе повну матеріальну відповідальність за
                  шкоду та збитки, завдані Виконавцеві шляхом псування його
                  обладнання та іншого майна.
                </li>
                <li>
                  Виконавець не несе ніякої відповідальності за будь – які
                  негативні наслідки, що можуть мати місце у випадку, якщо
                  Замовник має протипоказання щодо отримання Послуг за станом
                  свого здоров`я.
                </li>
                <li>
                  Виконавець не несе відповідальності за дії третіх осіб, які не
                  є його працівниками.
                </li>
                <li>
                  При втраті клубної карти, або її переоформленні на третю
                  особу, Замовник сплачує суму встановлену Прейскурантом клубу
                  200 гривень.
                </li>
                <li>
                  Оплачуючи Послуги Замовник підтверджує свою згоду із цим
                  договором а також те, що не має медичних протипоказань для
                  фізичних навантажень і отримання спортивно – оздоровчих
                  послуг. Клуб не несе відповідальності за шкоду, завдану
                  здоров’ю Члену Клуба, в результаті надання недостовірної
                  інформації щодо його здоров’я.
                </li>
                <li>
                  Адміністрація клубу має право вносити зміни в графік роботи
                  клубу, та у разі необхідності (проведення ремонтних та
                  санітарних робіт) тимчасово закривати доступ до окремих
                  приміщень клубу, що не являється неналежним виконанням своїх
                  зобов’язань і не тягне за собою продовження строку дії клубної
                  карти на період таких обмежень. При цьому Клієнт відмовляється
                  від додаткових претензій до фітнес клубу «Adrenalin».
                </li>
              </ol>
            </li>
            <li>
              Вартість послуг та порядок розрахунків
              <ol
                className="text-mainText dark:text-mainTextBlack text-left indent-5 list-decimal 
                        list-inside"
              >
                <li>
                  Вартість Послуг за цим Договором визначається підставі
                  затвердженого прейскуранту, що відповідає категорії та типу
                  обраної Замовником картки чи послуги.
                </li>
                <li>
                  Замовник сплачує вартість Послуг за цим Договором у
                  національній валюті України у термін, зазначений у рахунку на
                  сплату.
                </li>
                <li>
                  Підтвердженням оплати Договору є квитанція про оплату, видана
                  Замовникові або будь-який інший платіжний документ, що
                  підтверджує сплату коштів за цим Договором.
                </li>
                <li>
                  Кошти сплачені Замовником у відповідності до п.4.1 ст.4, цього
                  договору, поверненню не підлягають.
                </li>
                <li>
                  У випадку сплати Замовником частини від суми вартості послуг
                  (у вигляді завдатку), несплачений залишок від суми вартості
                  Послуг повинен бути сплачений протягом 30 (тридцяти)
                  календарних днів. Сторони домовились, що прострочення
                  Замовником встановленого цим пунктом строку вважається
                  відмовою Замовника від цього Договору з одночасним припиненням
                  його дії. При цьому сплачена Замовником сума (завдаток),
                  поверненню не підлягає ні за яких умов.
                </li>
              </ol>
            </li>
            <li>
              Строк дії договору, внесення змін та розірвання
              <ol
                className="text-mainText dark:text-mainTextBlack text-left indent-5 list-decimal 
                        list-inside"
              >
                <li>
                  Цей Договір набуває чинності з моменту його підписання
                  Сторонами, при цьому зобов’язання Виконавця щодо надання
                  Послуг Замовникові виникають з моменту активації Клубної
                  картки, та до останнього дня строку дії Клубної картки. Строк
                  дії цього Договору дорівнює строку дії Клубної картки.
                </li>
                <li>
                  Активація Клубної картки відбувається після першого
                  використання послуг Клубу або на 31 день з моменту оплати
                  послуги автоматично.
                </li>
                <li>
                  Зміни та доповнення до цього Договору, у тому числі пов’язані
                  з подовженням строку дії Клубної картки, можуть бути внесені
                  за згодою Сторін, про що Сторони або їх належно уповноважені
                  представники укладають відповідну додаткову угоду. Усі
                  додаткові угоди, укладені до цього Договору, є невід`ємною
                  частиною цього Договору. Внесення змін у додатки до цього
                  Договору відбувається з урахуванням особливостей, викладених в
                  Додатках.
                </li>
                <li>
                  Цей Договір не може бути розірваний шляхом односторонньої
                  відмови від нього. У разі дострокового припинення цього
                  Договору з ініціативи виконавця, вважається, що Замовник
                  отримав Послугу, а Виконавець вважається таким, що надав їх
                  належним чином та в повному обсязі.
                </li>
              </ol>
            </li>
            <li>
              Заключні положення
              <ol
                className="text-mainText dark:text-mainTextBlack text-left indent-5 list-decimal 
                        list-inside"
              >
                <li>
                  Якщо замовник не відвідує Клуб, не використовує свою Клубну
                  картку або використовує її не у повному обсязі внаслідок
                  вагітності, відрядження, хвороби та(або) внаслідок будь – яких
                  інших причин, строк дії Клубної картки не змінюється, а дата
                  закінчення строку її дії не переноситься, і відповідно,
                  грошові кошти, сплачені Замовником за цим Договором,
                  поверненню не підлягають, якщо інше не передбачено цим
                  Договором.
                </li>
                <li>
                  Перебування дітей на території Клубу регламентується Правилам
                  та підписанням Додаткової Угоди. Замовник зобов’язується
                  забезпечувати неухильне дотримання своєю дитиною – Правил
                  Клубу і несе особисту відповідальність за будь які негативні
                  наслідки, які можуть мати місце під час перебування дитини на
                  території Клубу.
                </li>
                <li>
                  Цим Замовник заявляє, що він усвідомлює, що факт укладення
                  цього договору означає, що: а) Замовник свідомо погоджується
                  на всі умови Договору; б) Замовник ознайомлений з тарифами
                  Виконавця і ціна послуг за цим Договором його повністю
                  влаштовує; в) стан здоров`я Замовника та (або) його дитини
                  споживати Послуги Виконавця також у відповідності до цього
                  договору і що Замовник та (або) його дитина не мають
                  протипоказань щодо занять спортом взагалі та фізичних
                  навантажень зокрема.
                </li>
              </ol>
            </li>
            <li>
              Форс – мажор
              <ol
                className="text-mainText dark:text-mainTextBlack text-left indent-5 list-decimal 
                        list-inside"
              >
                <li>
                  Форс – мажорними обставинами являються такі як : пожежа,
                  відключення електроенергії, відключення водопостачання,
                  державні дії, громадянська війна, стихійне лихо та інше.
                  Згідно до цих обставин Адміністрація клубу «Adrenalin» має
                  право – закривати клуб на необмежений термін та у майбутньому
                  без продовження клубної карти Замовника.
                </li>
              </ol>
            </li>
          </ol>
        </div>
      </section>
    </main>
  );
};
export default Oferta;
