import Link from 'next/link';

export const CaloriesDescription = () => {
  return (
    <div className="basis-1/2 text-mainText dark:text-mainTextBlack">
      <p className="mt-6 text-base lg:text-lg  text-justify">
        Скільки калорій треба, щоб схуднути, наростити м’язову масу або утримати
        свою теперішню вагу? Цей показник для кожного індивідуальний. Введіть
        свої дані, і калькулятор калорій за формулою Міффліна-Сан Жеора
        розрахує оптимальне значення саме для вас, враховуючи: стать, вік,
        зріст, теперішню вагу та активність
      </p>
      <p className="mt-6 text-base lg:text-lg  text-justify">
        Щоб схуднути, скоротіть кількість споживаних калорій в день на{' '}
        <strong> 10-15%</strong>. Якщо ви хочете набрати вагу, збільште на{' '}
        <strong>10-15%</strong> кількість калорій в день. Важливо: не
        рекомендується зменшувати загальну кількість калорій в день менше 1200
        калорій , так як це небезпечно для вашого здоров'я. Також не
        рекомендується втрачати більше 0,8 - 1 кг в тиждень.
      </p>
      <p className="mt-6 text-base lg:text-lg  text-justify">
        Для більш збалансованого схуднення на 0,5 - 0,8 кг на тиждень скоротіть
        споживання калорій на 5-7% , а решту 5-7% калорій втрачайте, виконуючи
        фізичні вправи для схуднення. Цей підхід запобігає зменшення вашого
        рівня метаболізму (обміну речовин) і допоможе зберегти м'язову масу. В
        такому випадку результат буде довготривалим.
      </p>
      <p className="text-lg font-bold mt-6 text-mainTitle dark:text-mainTitleBlack">
        Пам'ятайте, що надміру ваги сприяє ряд факторів:
      </p>
      <ul className="flex flex-col gap-1 text-justify mt-3 list-disc list-inside">
        <li>малоактивний спосіб життя;</li>
        <li>
          похибки в режимі харчування (надмірне споживання вуглеводів, жирів,
          солі, солодких і алкогольних напоїв, прийом їжі на ніч і ін);
        </li>
        <li>психологічне переїдання;</li>
        <li>фізіологічні стани (лактація, вагітність, клімакс);</li>
        <li>деякі ендокринні патології;</li>
        <li>
          стреси, недосипання, вживання психотропних і гормональних препаратів
          (стероїди, інсуліну, протизаплідних таблеток) і тощо.
        </li>
      </ul>
      <div>
        {' '}
        Короткі статті про{' '}
        <Link
          href="/learn/nutrition/diet-for-weight-lost"
          className="text-mainTitle dark:text-mainTitleBlack underline"
        >
          Раціон при схудненні
        </Link>{' '}
        та{' '}
        <Link
          href="/learn/nutrition/diet-for-gaining-weight"
          className="text-mainTitle dark:text-mainTitleBlack underline"
        >
          Раціон при наборі ваги
        </Link>
      </div>
    </div>
  );
};
